system/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
   // (0.01 0 0) //1
    (0.0145 0.3338 0) //1
    (-0.0145 0.3338 0) //2
    (0 0 1) //3
   // (0.01 0 1) //5
    (0.0145 0.3338 1) //4
    (-0.0145 0.3338 1) //5
);

blocks
(
    hex (0 1 2 0 3 4 5 3) (100 1 100) simpleGrading (0.1 1 1)
);

edges
(
    spline 1 4 (
                (0.01265 0.29 0.1)
                (0.01091 0.25 0.2)
                (0.00916 0.21 0.3)
                (0.00829 0.19 0.4)
                (0.00785 0.18 0.5)
                (0.00829 0.19 0.6)
                (0.00916 0.21 0.7)
                (0.01091 0.25 0.8)
                (0.01265 0.29 0.9)
                )

    spline 2 5 (
                (-0.01265 0.29 0.1)
                (-0.01091 0.25 0.2)
                (-0.00916 0.21 0.3)
                (-0.00829 0.19 0.4)
                (-0.00785 0.18 0.5)
                (-0.00829 0.19 0.6)
                (-0.00916 0.21 0.7)
                (-0.01091 0.25 0.8)
                (-0.01265 0.29 0.9)
                )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 4 5 3)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (2 1 4 5)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 3 5 2)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 3 4 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
