0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 99152;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1.4;
        p0              uniform 101325;
        value           uniform 101325;
    }
    front
    {
        type            wedge;
    }
    wall
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
