0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.168831;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0.168831;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.168831;
    }
    front
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
