0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 13;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 13;
        value           uniform 13;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 13;
    }
    front
    {
        type            wedge;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 13;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
