system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }

    /*pFinal
    {
        $p;
        relTol          0;
    }
    */
    "(U|e|k|epsilon)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }
    /*"(rho|U|e|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }
    */
}
/*
PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    nOuterCorrectors    2;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    consistent          yes;
    simpleRho           yes;

    //pMaxFactor          1.5;
    //pMinFactor          0.9;

    outerCorrectorResidualControl
    {
        "(U|k|epsilon)"
        {
            relTol          0;
            tolerance       0.0001;
        }
    }

    turbOnFinalIterOnly no;
}
*/

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor      0.01;
    pMaxFactor      20;
    transonic       yes;
    consistent      yes;

    residualControl
    {
        p               1e-3;
        U               1e-4;
        e               1e-3;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               1;
    }
    equations
    {
        p               1;
        U               0.9;
        e               0.5;
        k               0.2;
        epsilon         0.2;
    }
}


// ************************************************************************* //
